dataset_gen/NS_SL_openfoam/0/U
FoamFile
{
    version     2.0;
    format      ascii;
    class       volVectorField;
    object      U;
}
dimensions      [0 1 -1 0 0 0 0];

internalField   nonuniform List<vector>
16384
(
(-0.8902229998312958 0.0312976607699772 0.0)
(-0.8902229998312958 -0.060339095352424134 0.0)
(-0.8902229998312958 0.5887646907500013 0.0)
(-0.8902229998312958 0.16416670387888493 0.0)
(-0.8902229998312958 0.10504524126361506 0.0)
(-0.8902229998312958 -0.3214386974969056 0.0)
(-0.8902229998312958 -0.025115593353503485 0.0)
(-0.8902229998312958 0.07083676498833012 0.0)
...
);

boundaryField
{
    left
    {
        type cyclic;
    }
    right
    {
        type cyclic;
    }
    bottom
    {
        type cyclic;
    }
    top
    {
        type cyclic;
    }
    frontAndBack
    {
        type empty;
    }
}
