dataset_gen/NS_SL_openfoam/constant/polyMesh/boundary
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  2406                                  |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    arch        "LSB;label=32;scalar=64";
    class       polyBoundaryMesh;
    location    "constant/polyMesh";
    object      boundary;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

5
(
    left
    {
        type            cyclic;
        inGroups        1(cyclic);
        nFaces          128;
        startFace       32512;
        matchTolerance  0.0001;
        transform       unknown;
        neighbourPatch  right;
    }
    right
    {
        type            cyclic;
        inGroups        1(cyclic);
        nFaces          128;
        startFace       32640;
        matchTolerance  0.0001;
        transform       unknown;
        neighbourPatch  left;
    }
    bottom
    {
        type            cyclic;
        inGroups        1(cyclic);
        nFaces          128;
        startFace       32768;
        matchTolerance  0.0001;
        transform       unknown;
        neighbourPatch  top;
    }
    top
    {
        type            cyclic;
        inGroups        1(cyclic);
        nFaces          128;
        startFace       32896;
        matchTolerance  0.0001;
        transform       unknown;
        neighbourPatch  bottom;
    }
    frontAndBack
    {
        type            empty;
        inGroups        1(empty);
        nFaces          32768;
        startFace       33024;
    }
)

// ************************************************************************* //
